---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures
source: html/fa184122-8900-646e-1cca-ff3ae7123be6.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPSupportFailures

Failures about MEP suppor.

## Syntax (C#)
```csharp
public static class MEPSupportFailures
```